[
  {
    "id": 1,
    "name": "The Silent Patient",
    "author": "Alex Michaelides",
    "image": "https://i.ibb.co/7dT86MH0/silent-patient.png",
    "review": "This psychological thriller is a masterclass in suspense, weaving a complex narrative around Alicia, a painter who inexplicably stops speaking after committing a shocking act. The story unfolds through her therapist’s determined efforts to uncover the truth, blending psychological depth with unpredictable twists. The pacing is relentless, and the final revelation is both surprising and satisfying, making it a must-read for fans of the genre.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Thriller",
    "tags": ["Suspense", "Psychological", "Mystery"],
    "publisher": "Celadon Books",
    "yearOfPublishing": 2019
  },
  {
    "id": 2,
    "name": "Dune",
    "author": "Frank Herbert",
    "image": "https://i.ibb.co/DHgyPQFh/kisspng-dune-paul-atreides.png",
    "review": "A cornerstone of science fiction, this epic saga follows young Paul Atreides as he navigates a treacherous universe filled with political intrigue, religious prophecy, and ecological challenges. Herbert’s intricate world-building, from the desert planet Arrakis to its complex societies, is nothing short of breathtaking. The themes of power, betrayal, and survival resonate deeply, making this a timeless read that continues to influence the genre decades after its publication.",
    "totalPages": 688,
    "rating": 4.7,
    "category": "Science Fiction",
    "tags": ["Epic", "Sci-Fi", "Adventure"],
    "publisher": "Ace Books",
    "yearOfPublishing": 1965
  },
  {
    "id": 3,
    "name": "Educated",
    "author": "Tara Westover",
    "image": "https://i.ibb.co/1YdQkhy5/Educated.png",
    "review": "Tara Westover’s memoir is a powerful testament to the transformative power of education. Raised in a strict, isolated family in rural Idaho, she had no formal schooling until she was seventeen. Through sheer determination, she taught herself enough to attend university, eventually earning a PhD from Cambridge. The book is not just a story of academic triumph but a deeply emotional exploration of family, identity, and the cost of breaking free from one’s roots. Westover’s prose is vivid and introspective, making this a profoundly moving read.",
    "totalPages": 352,
    "rating": 4.6,
    "category": "Memoir",
    "tags": ["Nonfiction", "Inspirational", "Education"],
    "publisher": "Random House",
    "yearOfPublishing": 2018
  },
  {
    "id": 4,
    "name": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/5xt3v40R/The-Hobbit.png",
    "review": "This enchanting tale introduces readers to Bilbo Baggins, a reluctant hobbit thrust into an epic adventure filled with dragons, wizards, and treasure. Tolkien’s rich storytelling and vivid world-building create a magical experience that appeals to readers of all ages. The journey is as much about self-discovery as it is about facing external dangers, with Bilbo’s growth from a timid homebody to a courageous hero resonating deeply. It’s a classic that remains a joy to revisit.",
    "totalPages": 310,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Adventure", "Fantasy", "Classic"],
    "publisher": "Houghton Mifflin",
    "yearOfPublishing": 1937
  },
  {
    "id": 5,
    "name": "Sapiens ",
    "author": "Yuval Noah Harari",
    "image": "https://i.ibb.co/bgkFqJCk/Sapiens-A-Brief-History-of-Humankind.png",
    "review": "Harari takes readers on an ambitious journey through the history of our species, from the Stone Age to the modern era. With a blend of science, history, and philosophy, he examines how humans have shaped the world through culture, technology, and cooperation. The book is both accessible and provocative, challenging readers to rethink assumptions about progress, society, and our place in the universe. Its sweeping scope and insightful analysis make it a compelling read for anyone curious about humanity’s past and future.",
    "totalPages": 464,
    "rating": 4.4,
    "category": "Nonfiction",
    "tags": ["History", "Science", "Anthropology"],
    "publisher": "Harper",
    "yearOfPublishing": 2014
  },
  {
    "id": 6,
    "name": "The Night Circus",
    "author": "Erin Morgenstern",
    "image": "https://i.ibb.co/dskzvBPH/The-Night-Circus.png",
    "review": "This novel is a mesmerizing blend of magic, romance, and mystery, centered around a magical circus that appears without warning. The story follows two young magicians, Celia and Marco, bound in a mysterious competition by their mentors. Morgenstern’s lush, evocative prose brings the circus to life, with its enchanted tents and dreamlike atmosphere. The nonlinear narrative and richly developed characters create a spellbinding experience that lingers long after the final page.",
    "totalPages": 400,
    "rating": 4.3,
    "category": "Fantasy",
    "tags": ["Magical Realism", "Romance", "Fantasy"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2011
  },
  {
    "id": 7,
    "name": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/W4GbQCc1/1984.png",
    "review": "Orwell’s dystopian masterpiece paints a terrifying vision of a totalitarian society where surveillance, propaganda, and thought control dominate every aspect of life. Through Winston Smith’s rebellion against the oppressive Party, the novel explores themes of freedom, truth, and individuality. Its stark warnings about the dangers of authoritarianism and the manipulation of language remain chillingly relevant, making it a powerful and unsettling read that continues to provoke thought and discussion.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Dystopian",
    "tags": ["Dystopian", "Political", "Classic"],
    "publisher": "Signet Classics",
    "yearOfPublishing": 1949
  },
  {
    "id": 8,
    "name": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co/0p9wK5s9/The-Alchemist.png",
    "review": "This timeless fable follows Santiago, a young Andalusian shepherd, on his quest to follow his dreams and discover his Personal Legend. Coelho’s lyrical prose and philosophical insights create a deceptively simple story that resonates with readers seeking purpose and meaning. The journey is filled with encounters that teach lessons about courage, destiny, and listening to one’s heart. Its universal themes and uplifting message make it a beloved classic across cultures.",
    "totalPages": 208,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["Inspirational", "Adventure", "Philosophical"],
    "publisher": "HarperOne",
    "yearOfPublishing": 1988
  },
  {
    "id": 9,
    "name": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/tTn7g3Hs/The-Catcher-in-the-Rye.png",
    "review": "Salinger’s iconic novel captures the raw, unfiltered voice of Holden Caulfield, a disillusioned teenager navigating a world he finds hypocritical and alienating. Through his aimless wanderings in New York City, Holden grapples with grief, identity, and the loss of innocence. The novel’s intimate, conversational style and unflinching honesty make it a powerful exploration of adolescence and rebellion, resonating with readers who have ever felt out of place in the world.",
    "totalPages": 277,
    "rating": 4.0,
    "category": "Literary Fiction",
    "tags": ["Coming-of-Age", "Classic", "Literary"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "id": 10,
    "name": "Where the Crawdads Sing",
    "author": "Delia Owens",
    "image": "https://i.ibb.co/XfTwYVfK/Where-the-Crawdads-Sing.png",
    "review": "This evocative novel combines a coming-of-age story with a murder mystery, set against the lush backdrop of the North Carolina marshes. Kya, known as the 'Marsh Girl,' grows up in isolation, finding solace in nature while facing prejudice from the nearby town. Owens weaves a tale of resilience, love, and survival, with vivid descriptions of the natural world and a compelling mystery that keeps readers hooked. The emotional depth and lyrical prose make this a standout read.",
    "totalPages": 384,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Mystery", "Romance", "Nature"],
    "publisher": "G.P. Putnam’s Sons",
    "yearOfPublishing": 2018
  }
]